In [1]:
import pandas as pd

In [3]:
s1 = pd.Series(["a", "b", "c"])
s2 = pd.Series(["d", "e", "f"])
s1

0    a
1    b
2    c
dtype: object

<h3> Concat on one top of other </h3>

In [6]:
pd.concat([s1, s2]) ##order is important 

##index will be preserved for each row

0    a
1    b
2    c
0    d
1    e
2    f
dtype: object

In [7]:
pd.concat([s1, s2], ignore_index = True) ##will create a new index from screach

0    a
1    b
2    c
3    d
4    e
5    f
dtype: object

<h3> Concat series by index to create a new df</h3>

In [13]:
c1 = pd.Series(["red", "orange", "yellow"])
c2 = pd.Series(["green", "blue", "purple", "grey"])


pd.concat([c1, c2], axis = 1) ## it will match the index of the two series and then add them up (like pairing red and green)

        0       1
0     red   green
1  orange    blue
2  yellow  purple
3     NaN    grey

In [14]:
fruits = pd.Series(
    data=["apple", "banana", "cherry"], 
    index=["a","b", "c"]
)

animals = pd.Series(
    data=["badger", "cougar", "anaconda"], 
    index=["b", "c", "a"]
)

In [17]:
pd.concat([fruits, animals], axis = 1, keys = ["fruit", "animal"]) ##even though indices are in different order it will match a with a index

    fruit    animal
a   apple  anaconda
b  banana    badger
c  cherry    cougar

In [18]:
##keys also work in other direction to give hierarchical index

pd.concat([fruits, animals], axis = 0, keys = ["fruit", "animal"])

fruit   a       apple
        b      banana
        c      cherry
animal  b      badger
        c      cougar
        a    anaconda
dtype: object

<h3> Inner vs Outer Joins</h3>

In [22]:
fruits = pd.Series(
    data=["apple", "banana", "cherry", "durian"], 
    index=["a","b", "c", "d"]
)

animals = pd.Series(
    data=["badger", "cougar", "anaconda", "elk", "pika"], 
    index=["b", "c", "a", "e", "p"]
)

In [24]:
pd.concat([fruits, animals], axis = 1) ## this will do outer join by default

        0         1
a   apple  anaconda
b  banana    badger
c  cherry    cougar
d  durian       NaN
e     NaN       elk
p     NaN      pika

In [25]:
pd.concat([fruits, animals], axis = 1, join  = "inner") ## this will do inner join

        0         1
a   apple  anaconda
b  banana    badger
c  cherry    cougar

<h3>  Combining Dataframes </h3>

In [26]:
harvest_21 = pd.DataFrame(
    [['potatoes', 900], ['garlic', 1350], ['onions', 875]], 
    columns=['crop', 'qty']
)

harvest_22 = pd.DataFrame(
    [['garlic', 1600], ['spinach', 560], ['turnips', 999], ['onions', 1000]], 
    columns=['crop', 'qty']
)

In [28]:
pd.concat([harvest_21, harvest_22], keys = [2021, 2022])

            crop   qty
2021 0  potatoes   900
     1    garlic  1350
     2    onions   875
2022 0    garlic  1600
     1   spinach   560
     2   turnips   999
     3    onions  1000

In [29]:
pd.concat([harvest_21, harvest_22], axis = 1, keys = [2021, 2022])

       2021             2022
       crop     qty     crop   qty
0  potatoes   900.0   garlic  1600
1    garlic  1350.0  spinach   560
2    onions   875.0  turnips   999
3       NaN     NaN   onions  1000

In [31]:
harvest_23 = pd.DataFrame(
    [['potatoes', 900, 500], ['garlic', 1350, 1200], ['onions', 875, 950]], 
    columns=['crop', 'qty', 'profit']
)
pd.concat([harvest_21, harvest_22, harvest_23]) ## will give None values for where profit is not availablex

       crop   qty  profit
0  potatoes   900     NaN
1    garlic  1350     NaN
2    onions   875     NaN
0    garlic  1600     NaN
1   spinach   560     NaN
2   turnips   999     NaN
3    onions  1000     NaN
0  potatoes   900   500.0
1    garlic  1350  1200.0
2    onions   875   950.0

In [32]:
pd.concat([harvest_21, harvest_22, harvest_23], join = "inner") ## will drop the profit columns

       crop   qty
0  potatoes   900
1    garlic  1350
2    onions   875
0    garlic  1600
1   spinach   560
2   turnips   999
3    onions  1000
0  potatoes   900
1    garlic  1350
2    onions   875

<h3> Concat df by index</h3>

In [33]:
livestock = pd.DataFrame(
    [['pasture', 9], ['stable', 3], ['coop', 34]], 
    columns=['location', 'qty'],
    index=['alpaca', 'horse', 'chicken']
)
weights = pd.DataFrame(
    [[4,10], [900, 2000], [1.2, 4], [110, 150]], 
    columns=['min_weight', 'max_weight'],
    index=['chicken', 'horse', 'duck', 'alpaca']
)

In [34]:
livestock

        location  qty
alpaca   pasture    9
horse     stable    3
chicken     coop   34

In [35]:
weights

         min_weight  max_weight
chicken         4.0          10
horse         900.0        2000
duck            1.2           4
alpaca        110.0         150

In [36]:
pd.concat([livestock, weights], axis = 1)

        location   qty  min_weight  max_weight
alpaca   pasture   9.0       110.0         150
horse     stable   3.0       900.0        2000
chicken     coop  34.0         4.0          10
duck         NaN   NaN         1.2           4

In [37]:
pd.concat([livestock, weights], axis = 1, join = "inner")

        location  qty  min_weight  max_weight
alpaca   pasture    9       110.0         150
horse     stable    3       900.0        2000
chicken     coop   34         4.0          10

<h3> Dataframe merge method </h3>

**this is a df method**

In [38]:
teams = pd.DataFrame(
    [
        ["Suns", "Phoenix", 20, 4], 
        ["Mavericks", "Dallas", 11,12], 
        ["Rockets", "Houston", 7, 16],
        ['Nuggets', "Denver", 11, 12]
    ], 
    columns=["team", "city", "wins", "losses"]
)

cities = pd.DataFrame(
    [
        ["Houston", "Texas", 2310000], 
        ["Phoenix", "Arizona", 1630000], 
        ["San Diego", "California", 1410000],
        ["Dallas", "Texas", 1310000]
    ],
    columns=["city", "state", "population"]
)

In [39]:
teams.merge(cities) ## so pandas will automatically pick common columns and join based on that

        team     city  wins  losses    state  population
0       Suns  Phoenix    20       4  Arizona     1630000
1  Mavericks   Dallas    11      12    Texas     1310000
2    Rockets  Houston     7      16    Texas     2310000

<h3> Merge w/ left, right, inner, outer joins</h3>

In [40]:
## we can define which column we want to merge on 

teams.merge(cities, on = "city")

        team     city  wins  losses    state  population
0       Suns  Phoenix    20       4  Arizona     1630000
1  Mavericks   Dallas    11      12    Texas     1310000
2    Rockets  Houston     7      16    Texas     2310000

**default is inner join**

In [44]:
teams.merge(cities, on = "city", how = "inner") ## only common rows will be included

        team     city  wins  losses    state  population
0       Suns  Phoenix    20       4  Arizona     1630000
1  Mavericks   Dallas    11      12    Texas     1310000
2    Rockets  Houston     7      16    Texas     2310000

In [45]:

teams.merge(cities, on = "city", how = "left") ## all rows from left df will be incliuded

        team     city  wins  losses    state  population
0       Suns  Phoenix    20       4  Arizona   1630000.0
1  Mavericks   Dallas    11      12    Texas   1310000.0
2    Rockets  Houston     7      16    Texas   2310000.0
3    Nuggets   Denver    11      12      NaN         NaN

In [47]:
teams.merge(cities, on = "city", how = "right") ## all rows from right df will b included

        team       city  wins  losses       state  population
0    Rockets    Houston   7.0    16.0       Texas     2310000
1       Suns    Phoenix  20.0     4.0     Arizona     1630000
2        NaN  San Diego   NaN     NaN  California     1410000
3  Mavericks     Dallas  11.0    12.0       Texas     1310000

In [48]:
teams.merge(cities, on = "city", how = "outer") ## all rows from both df will be included

        team       city  wins  losses       state  population
0  Mavericks     Dallas  11.0    12.0       Texas   1310000.0
1    Nuggets     Denver  11.0    12.0         NaN         NaN
2    Rockets    Houston   7.0    16.0       Texas   2310000.0
3       Suns    Phoenix  20.0     4.0     Arizona   1630000.0
4        NaN  San Diego   NaN     NaN  California   1410000.0

<h3>  Merge on and suffixes argument </h3>

In [49]:
midterms = pd.DataFrame(
    [['alex', 'padilla', 92], ['rayna', 'wilson', 83], ['juan', 'gomez', 78], ['angela', 'smith', 66],['stephen', 'yu', 98]], 
    columns=['first', 'last', 'score']
)
finals = pd.DataFrame(
    [['alex','padilla', 97, False], ['rayna', 'wilson', 88, False], ['alex', 'smith', 86, True], ['juan', 'gomez', 71, True], ['stephen', 'yu', 78, False], ['sakura', 'steel', 100, True]], 
    columns=['first', 'last','score', 'extra_credit']
)

In [50]:
midterms

     first     last  score
0     alex  padilla     92
1    rayna   wilson     83
2     juan    gomez     78
3   angela    smith     66
4  stephen       yu     98

In [51]:
finals

     first     last  score  extra_credit
0     alex  padilla     97         False
1    rayna   wilson     88         False
2     alex    smith     86          True
3     juan    gomez     71          True
4  stephen       yu     78         False
5   sakura    steel    100          True

**3 column names which are common in 2 df**

In [52]:
midterms.merge(finals, on = "score")

  first_x last_x  score  first_y last_y  extra_credit
0    juan  gomez     78  stephen     yu         False

In [54]:
midterms.merge(finals, on = ["first", "last"]) 

##score_x is from midterms, score_y is from finals

     first     last  score_x  score_y  extra_credit
0     alex  padilla       92       97         False
1    rayna   wilson       83       88         False
2     juan    gomez       78       71          True
3  stephen       yu       98       78         False

In [56]:
midterms.merge(finals, on = ["first", "last"], suffixes = ["_midterms", "_finals"]) #renaming the common columns

     first     last  score_midterms  score_finals  extra_credit
0     alex  padilla              92            97         False
1    rayna   wilson              83            88         False
2     juan    gomez              78            71          True
3  stephen       yu              98            78         False